In [28]:
import pandas as pd

In [29]:
# Pandas 의 Series 생성
series1=pd.Series([1,2,3,4,5])
series1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [30]:
#인덱스 지정해서 Series생성
series2=pd.Series([1,2,3,4,5], index=['일','이','삼','사','오'])
series2

일    1
이    2
삼    3
사    4
오    5
dtype: int64

In [31]:
population = pd.Series([9904312,3448737,2890451,2466052], index=['서울','부산','인천','대구'])
population

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [32]:
population.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [33]:
population.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [34]:
population.dtype

dtype('int64')

In [35]:
population.name = '인구'
population

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [36]:
population.index.name = '도시'
population

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [37]:
#시리즈 연산
population / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [38]:
#시리즈 인덱싱
population[1] #인덱스 번호 사용

3448737

In [39]:
# 지정한 인덱스 사용
population['부산']

3448737

In [40]:
#리스트를 활용한 인덱싱
# 순서 횟수에 상관없음

population[['서울','부산']]

도시
서울    9904312
부산    3448737
Name: 인구, dtype: int64

In [41]:
population[['인천','서울','인천']]

도시
인천    2890451
서울    9904312
인천    2890451
Name: 인구, dtype: int64

In [42]:
population[[0,3,1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [43]:
############################            poppulation['도시']

In [44]:
#Boolean인덱싱
#인구수가 250만 이상인 도시의 정보 출력
population >= 2500000

도시
서울     True
부산     True
인천     True
대구    False
Name: 인구, dtype: bool

In [45]:
population[population >= 2500000]

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [46]:
# 500만 이하 도시 정보 출력
population <= 5000000

도시
서울    False
부산     True
인천     True
대구     True
Name: 인구, dtype: bool

In [47]:
population[population <= 5000000]

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [48]:
# 인구수가 250만 이상이고 500만 이하의 도시 정보 출력
# pandas는 and 연산자 인식을 못함 

population[population >= 2500000] +population[population <= 5000000]

도시
대구          NaN
부산    6897474.0
서울          NaN
인천    5780902.0
Name: 인구, dtype: float64

In [49]:
# add, and  연산자 인식을 못함
population[population >= 2500000] add [population <= 5000000]

SyntaxError: invalid syntax (Temp/ipykernel_2396/3796777029.py, line 2)

In [ ]:
population[(population >= 2500000)] & (population <= 5000000)

In [ ]:
# 쌤 풀이
population[(population >= 2500000) & (population <= 5000000)]

In [ ]:
#상민 팀장님 풀이
population[population<=5000000][population>=2500000]

In [ ]:
#슬라이싱
population

In [ ]:
#인덱스 번호로 슬라이싱 [첫번째 수 : 끝수+1 ]
population[1:3]

In [ ]:
# 지정한 인덱스로 슬라이싱 [첫번쨰 값 : 끝나는 값]
population['부산':'대구']

In [ ]:
# 딕셔너리 객체로 Series 생성
# 인덱스 부여가 자동으로 완성
# key = 인덱스
# values = 값
#      =  { key: values,  .........}

In [ ]:
data = {'서울': 9631482, '부산':3393191, '인천':2632035, '대전':1490158}
population2 = pd.Series(data)
population2

In [ ]:
#population : 2010년인구
#population2 : 2015년 인구
# 2015년도와 2010년 인구 증가를 계산
ds = population - population2
ds

In [ ]:
print(population.index)
print(population2.index)
# 순서에 상관없이 같은 인덱스의 값을 가지고 있는 것끼리 계산

In [ ]:
# notnull():   null이 아니면 T, null 이면 F
ds[ds.notnull()]

In [ ]:
# isnall():   null이 아니면 F, null 이면  T
ds[ds.isnull()]

In [ ]:
#2015년도와 2010년 인구 증가율 계산
# 단, 없는 값은 출력X
# 인구증가율 = (2015 인구 -2010 인구) / 2010년 인구  * 100

In [ ]:
a = ds[ds.notnull()] 
a

In [ ]:
c = population2[population2.notnull()]

In [ ]:
b= a / c *100
b

In [ ]:
#쌤풀이 (계산 후 null 값 빼기)
rs = ds /population2 *100
rs[rs.notnull()]

In [ ]:
#Series 값 갱신 추가 삭제
rs

In [ ]:
# 대구의 값 갱신
rs['대구']

In [ ]:
# 가지고  있는 값을 넣으면 값 갱신
rs['대구'] = 1.41
rs

In [ ]:
#값 추가
# 가지고 있지 않은 값을 넣으면 추가
rs['광주'] = 2.08
rs

In [ ]:
# 값 삭제
del rs['대전']
rs

# DataFrame

In [50]:
#딕셔너리를 통해서 DataFrame만들기

# column 이 key 값으로 사용 됨.

data={
    "2015": [9904312,3448737,2890451,2466052],
    "2010": [9631482,3393191,2632035,2431774]
}
df =pd.DataFrame(data)
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [51]:
# DaraFrame 생성 후에  index 설정
df.index = ['서울','부산','인천','대구']
df

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [57]:
# DataFrame 생성시, index 지정, column지정
data=[
   [9904312,3448737,2890451,2466052],
   [9631482,3393191,2632035,2431774]
]

ind = ['2015', '2010']
col = ['서울', '부산', '인천','대구']
                        # index=i       columns 
df2 = pd.DataFrame(data,index = ind , columns = col )
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [61]:
#전치  T 
df2.T

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [62]:
#전치 transpose()  : 전치가 가능한 모든 제이터에 적용 가능
df2 = df2.transpose()
df2

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [ ]:
#행과 열은 바꿔서 출력 해주지만 저장은 해주지 않는다.!!!!

In [ ]:
#데이터프레임 정보 확인
#값 확인 : values
#인덱스확인 : index
#컬럼 확인 : columns

In [65]:
df2.values

array([[9904312, 9631482],
       [3448737, 3393191],
       [2890451, 2632035],
       [2466052, 2431774]], dtype=int64)

In [66]:
df2.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

df2.columns

In [67]:
#데이터프레임에 값 추가
#컬럼을 기준으로 값 추가
#
#   [ 컬럼 ]= [     추가 할 값    ]
df2['2005']=[9762546,3512547,2517680,2456016]
df2

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [69]:
# 값 수정 : 기존에 가지고 있는 컬럼을 입력시 값의 수정이 이루어짐
df2['2005']=[9762546,3512547,2517680,2450]
df2

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774     2450

In [70]:
df2['2005']=[9762546,3512547,2517680,2450000]
df2

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2450000

In [71]:
# 인덱싱 
#컬럼으로 인덱싱하기

df2['2010']
#하나의 컬럼을 출력시 Series로 출력

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [72]:
df2[['2015','2005']] 
# 리트스를 사용한 인덱싱 하면 여러개의 값이 묶여서 데이터 프레임으로 출력

       2015     2005
서울  9904312  9762546
부산  3448737  3512547
인천  2890451  2517680
대구  2466052  2450000

In [73]:
# 리스트를 사용한 인덱싱
# 데이터 프레임으로 출력
df2[["2010"]]

       2010
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [74]:
# 슬라이싱
# 인덱스 기준 컬럼을 기준으로 하는 슬라이싱
df2[0:2]

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547

In [76]:
df2[:]

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2450000

In [79]:
df2[1:2]

       2015     2010     2005
부산  3448737  3393191  3512547

df2[2:]

In [80]:
df2[1:2][2:4]

Empty DataFrame
Columns: [2015, 2010, 2005]
Index: []

In [81]:
df2['서울' : '인천']

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680

In [82]:
#인덱서
#iloc : 인넥스의 번호 사용
df2.iloc[2]

2015    2890451
2010    2632035
2005    2517680
Name: 인천, dtype: int64

In [87]:
 df2.iloc[:2,:2]

       2015     2010
서울  9904312  9631482
부산  3448737  3393191

In [84]:
#loc : 지정한 인덱스 사용
# loc[  index,  column  ]  
df2.loc["서울":"부산", "2015":"2010"]

       2015     2010
서울  9904312  9631482
부산  3448737  3393191

In [64]:
data1=[
   [9904312,3448737,2890451,2466052],
   [9631482,3393191,2632035,2431774]
]
d = ['서울', '부산', '인천','대구']
c = ['2015', '2010']


df3 = pd.DataFrame(data1,index = d, columns = c)
df3

ValueError: 2 columns passed, passed data had 4 columns

In [ ]:
# DataFrame 에서 Boolean indexing

In [ ]:
#불리언 데이터 만들기
# 2010년 인구가 2500000 이상인 데이터 출력 (T)

In [88]:
df2

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2450000

In [91]:
dd =df2.loc[:, '2010':'2010']
dd

       2010
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [92]:
dd >= 2500000

     2010
서울   True
부산   True
인천   True
대구  False

In [99]:
dd =df2.loc[:, '2010':'2010'] >= 250000
dd

    2010
서울  True
부산  True
인천  True
대구  True

In [113]:
df2.loc[dd,:]

ValueError: Cannot index with multidimensional key

In [93]:
# 쌤풀이 
bol = df2.loc[:, '2010'] >= 2500000
bol

서울     True
부산     True
인천     True
대구    False
Name: 2010, dtype: bool

In [94]:
df2.loc[bol,:]

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680

In [ ]:
# csv파일 불러오기
#pd.read_csv(파일명  , encoding='euc-kr'  )

In [101]:
pd.read_csv('population_number.csv', encoding='euc-kr')

   도시   지역     2015       2010       2005     2000
0  서울  수도권  9904312  9631482.0  9762546.0  9853972
1  부산  경상권  3448737        NaN        NaN  3655437
2  인천  수도권  2890451  2632035.0        NaN  2466338
3  대구  경상권  2466052  2431774.0  2456016.0  2473990

In [103]:
pn = pd.read_csv('population_number.csv', encoding='euc-kr', index_col='도시')
pn

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [104]:
# 값의 갯수 세기
#value_counts
pn.loc[:,'지역']

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [105]:
pn.loc[:,'지역'].value_counts()

수도권    2
경상권    2
Name: 지역, dtype: int64

In [112]:
pn.loc[:,'2015':'2005'].value_counts()

2015     2010       2005
2466052  2431774.0  2456016.0    1
9904312  9631482.0  9762546.0    1
dtype: int64

In [114]:
#상민팀장님 풀이

pn.loc[:,['지역','2010']].value_counts()

지역   2010
경상권  2431774.0    1
수도권  2632035.0    1
     9631482.0    1
dtype: int64

In [ ]:
#정렬